#         7
#       3   8
#     8   1   0
#   2   7   4   4
# 4   5   2   6   5
# 위 그림은 크기가 5인 정수 삼각형의 한 모습이다.

# 맨 위층 7부터 시작해서 아래에 있는 수 중 하나를 선택하여 아래층으로 내려올 때, 이제까지 선택된 수의 합이 최대가 되는 경로를 구하는 프로그램을 작성하라. 아래층에 있는 수는 현재 층에서 선택된 수의 대각선 왼쪽 또는 대각선 오른쪽에 있는 것 중에서만 선택할 수 있다.

# 삼각형의 크기는 1 이상 500 이하이다. 삼각형을 이루고 있는 각 수는 모두 정수이며, 범위는 0 이상 9999 이하이다.

#dp[i][j]는 i는 현재 층, j는 현재 층에서 위치. 값은 현재 이 위치까지 더했을때 가장 큰 값.
N= int(input())
dp = [[0] * (N+1) for _ in range(N+1)]
for i in range(1, N+1):
    x = list(map(int,input().split()))
    for j in range(len(x)):
        dp[i][j+1] = x[j]

for i in range(2,N+1):
    for j in range(1, N+1):
        l= r= 0
        if j-1 != 0:
            l = dp[i-1][j-1]
        if j != i:
            r = dp[i-1][j]
        dp[i][j] += max(l, r)

print(max(dp[N]))