# 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.

# 1+1+1+1
# 1+1+2
# 1+2+1
# 2+1+1
# 2+2
# 1+3
# 3+1
# 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

T = int(input())
for _ in range(T):
    n = int(input())
    #일단 더하는 수들이 순서와 상관이 있음!!!
    #순서는 상관없지만 1부터해서 더해주고
    #그 뒤에 더하면서 그 이전값을 계승해서 더해줘야 함
    #dp[i]=> i는 현재 수이고, 값은 방법의 갯수임
    #dp[i] = dp[i-1] + dp[i-2] +dp[i-3]
    dp = [0] * (n+1)
    dp[0] = 1
    dp[1] = 1
    for i in range(2, n+1):
        if i-1 >=0:
            dp[i] += dp[i-1]
        if i-2 >=0:
            dp[i] += dp[i-2]
        if i-3 >=0:
            dp[i] += dp[i-3]
    print(dp[n])