# 정수 X에 사용할 수 있는 연산은 다음과 같이 세 가지 이다.

# X가 3으로 나누어 떨어지면, 3으로 나눈다.
# X가 2로 나누어 떨어지면, 2로 나눈다.
# 1을 뺀다.
# 정수 N이 주어졌을 때, 위와 같은 연산 세 개를 적절히 사용해서 1을 만들려고 한다. 연산을 사용하는 횟수의 최솟값을 출력하시오.

N = int(input())

inf = 1000000
#1을 시작으로 3을 곱하거나 2를 곱하거나 1을 더해서 N까지 완성하기
#각 dp의 값은 연산횟수가 들어감
# dp 계산을 할때 최솟값을 구해야 하므로 초기값을 무한으로 잡음
#dp[i*+ x] = dp[i] +1 
dp= [inf] * (N+1)
dp[1] = 0
for i in range(1, N+1):
    if 3*i <= N:
        dp[3*i] = min(dp[i] +1, dp[3*i])
    if 2*i <= N:
        dp[2*i] = min(dp[i] +1, dp[2*i])
    if i+1 <= N:
        dp[i+1] = min(dp[i] +1, dp[i+1])
print(dp[N])